"""
    Объявить переменные name, age, city,
    присвоив им значения с помощью input().
    Вывести на экран текст типа:
    Max from Kiev
    He is 21
"""

name = input("Enter name: ")
age = input("Age: ")
city = input("City: ")
print(name, "is from", city)
print(name, "is", age)
