"""
    Ввести с помощью input() 3 числа.
    Вывести их с помощью print() в обратном порядке.
    Пример работы программы:
    Ввод:
    1
    125
    13
    Вывод:
    13
    125
    1
"""

var_1 = input("Введите число 1: ")
var_2 = input("Введите число 2: ")
var_3 = input("Введите число 3: ")
print(var_3, var_2, var_1)